# Ultralytics YOLO 🚀, AGPL-3.0
# Homogeneous/Heterogeneous Feature Separation Architecture

nc: 6
scales:
  n: [0.33, 0.50, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # ========== Prior Extraction Module ==========
  - [[-1, -1], 1, PriorExtractor_Multi, [256, 512, 1024, 0.05, 5]]  # 0-prior (c3, c4, c5, sigma, window_size)

  # ========== Homogeneous Feature Extraction Path ==========
  - [[-1, -1], 1, Conv_adalora_sym_m_homo, [64, 3, 2, 9, 9, 0.]]   # 1-homo  P1/2
  - [-1, 1, Conv_adalora_sym_m_homo, [128, 3, 2, 9, 9, 0.]]        # 2-homo  P2/4
  - [-1, 3, C2f_adalora_sym_m_homo, [128, True, 9, 9, 0.]]         # 3-homo
  - [-1, 1, Conv_adalora_sym_m_homo, [256, 3, 2, 9, 9, 0.]]        # 4-homo  P3/8
  - [-1, 6, C2f_adalora_sym_m_homo, [256, True, 9, 9, 0.]]         # 5-homo  <- P3 homogeneous features
  - [-1, 1, Conv_adalora_sym_m_homo, [512, 3, 2, 9, 9, 0.]]        # 6-homo  P4/16
  - [-1, 6, C2f_adalora_sym_m_homo, [512, True, 9, 9, 0.]]         # 7-homo  <- P4 homogeneous features
  - [-1, 1, Conv_adalora_sym_m_homo, [1024, 3, 2, 9, 9, 0.]]       # 8-homo  P5/32
  - [-1, 3, C2f_adalora_sym_m_homo, [1024, True, 9, 9, 0.]]        # 9-homo
  - [-1, 1, SPPF_adalora_sym_m_homo, [1024, 5, 9, 9, 0.]]          # 10-homo <- P5 homogeneous features

  # ========== Heterogeneous Feature Extraction Path + Prior Injection ==========
  - [[-1, -1], 1, Conv_adalora_sym_m_het, [64, 3, 2, 9, 9, 0.]]    # 11-het  P1/2
  - [-1, 1, Conv_adalora_sym_m_het, [128, 3, 2, 9, 9, 0.]]         # 12-het  P2/4
  - [-1, 3, C2f_adalora_sym_m_het, [128, True, 9, 9, 0.]]          # 13-het
  - [-1, 1, Conv_adalora_sym_m_het, [256, 3, 2, 9, 9, 0.]]         # 14-het  P3/8
  - [-1, 6, C2f_adalora_sym_m_het, [256, True, 9, 9, 0.]]          # 15-het  P3 heterogeneous features (tuple)
  - [[15, 0], 1, Add_Prior, [256, 0]]                              # 16-het  <- P3 heterogeneous features enhanced (inject P3 prior)
  - [-1, 1, Conv_adalora_sym_m_het, [512, 3, 2, 9, 9, 0.]]         # 17-het  P4/16
  - [-1, 6, C2f_adalora_sym_m_het, [512, True, 9, 9, 0.]]          # 18-het  P4 heterogeneous features (tuple)
  - [[18, 0], 1, Add_Prior, [512, 1]]                              # 19-het  <- P4 heterogeneous features enhanced (inject P4 prior)
  - [-1, 1, Conv_adalora_sym_m_het, [1024, 3, 2, 9, 9, 0.]]        # 20-het  P5/32
  - [-1, 3, C2f_adalora_sym_m_het, [1024, True, 9, 9, 0.]]         # 21-het
  - [-1, 1, SPPF_adalora_sym_m_het, [1024, 5, 9, 9, 0.]]           # 22-het  P5 heterogeneous features (tuple)
  - [[22, 0], 1, Add_Prior, [1024, 2]]                             # 23-het  <- P5 heterogeneous features enhanced (inject P5 prior)

  # ========== P5 Homogeneous Feature Fusion ==========
  - [[10], 1, FusionMamba, [1024, 8, 8]]                           # 24  Input: (F_Homo_RGB_P5, F_Homo_IR_P5)
  - [[-1, 10], 1, FourInputFusionBlock, [512]]                    # 25  Output: single fused feature

head:
  # ========== FPN: Top-down + DCN Alignment ==========

  # --- P5 -> P4 ---
  - [25, 1, nn.Upsample, [None, 2, "nearest"]]                     # 26  Up_P5 (shared)
  - [[7], 1, DCN_Offset_Conv, [512]]                               # 27  Learn Offset_P4 (input: P4 homogeneous tuple)
  - [[7, 27], 1, DCN_Warp_RGB, [512]]                               # 28  Warped_IR_P4 (take IR from tuple, use positive offset)
  - [[26, 28, 7], 1, Concat_IR, [1]]                              # 29  Concatenate RGB side (take RGB from tuple)
  - [-1, 3, C2f, [512]]                                            # 30  FPN_P4_RGB


  # --- P4 -> P3 ---
  - [30, 1, nn.Upsample, [None, 2, "nearest"]]                     # 31  Up_P4_RGB
  - [[5], 1, DCN_Offset_Conv, [256]]                               # 32  Learn Offset_P3
  - [[5, 32], 1, DCN_Warp_RGB, [256]]                               # 33  Warped_IR_P3
  - [[31, 33, 5], 1, Concat_IR, [1]]                              # 34  Concatenate RGB side

  - [[16], 1, DCN_Offset_Conv, [256]]                               # 35
  - [[16, 35], 1, DCN_Warp_RGB, [256]]                               # 36
  - [[34, 36, 16], 1, Concat_IR, [1]]                              # 37
  - [-1, 3, C2f, [256]]                                            # 38  FPN_P3_RGB

  # ========== PAN: Bottom-up + Heterogeneous Feature Injection ==========

  # --- P3 level: inject heterogeneous features ---

  # --- P3 -> P4 ---
  - [-1, 1, Conv, [256, 3, 2]]                                     # 39  Down_P3_RGB
  - [[19], 1, DCN_Offset_Conv, [512]]                              # 40
  - [[19, 40], 1, DCN_Warp_RGB, [512]]                              # 41
  - [[39, 41, 19], 1, Concat_IR, [1]]                              # 42  Concatenate RGB side
  - [-1, 3, C2f, [512]]                                            # 43  PAN_P4_RGB


  # --- P4 -> P5 ---
  - [-1, 1, Conv, [512, 3, 2]]                                     # 44  Down_P4_RGB
  - [[25, 23], 1, Add_RGB, [1024]]                                 # 45  FPN_P5 + F_Het_RGB_P5 enhanced
  - [[-1, 23], 1, Add_IR, [1024]]                                  # 46  FPN_P5 + F_Het_IR_P5 enhanced
  - [[44, 46], 1, Concat_RGB, [1]]                                 # 47  Concatenate RGB side
  - [-1, 3, C2f, [1024]]                                           # 48  PAN_P5_RGB


  # ========== Dual Detection Heads ==========
  - [[38, 43, 48], 1, Detect, [nc]]                                # 49  OBB_Head_RGB
